#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_cloudfront_origin_access_identity.default: Refreshing state... [id=E3MZV8ZRF1OECX]
module.newrelic_log_ingestion.aws_cloudwatch_log_group.lambda_logs: Refreshing state... [id=/aws/lambda/newrelic-log-ingestion]
aws_s3_bucket.frontend: Refreshing state... [id=cesko-digital-kalkulacka-frontend-2]
aws_s3_bucket.data: Refreshing state... [id=cesko-digital-kalkulacka-data]
aws_ecr_repository.backend: Refreshing state... [id=backend]
module.newrelic_log_ingestion.aws_iam_role.lambda_role[0]: Refreshing state... [id=newrelic-log-ingestion]
aws_iam_role.kalkulacka: Refreshing state... [id=kalkulacka]
module.newrelic_log_ingestion.null_resource.build_lambda[0]: Refreshing state... [id=4744747442388673836]
aws_ecr_lifecycle_policy.backend-expire-old: Refreshing state... [id=backend]
module.newrelic_log_ingestion.aws_iam_role_policy_attachment.lambda_log_policy[0]: Refreshing state... [id=newrelic-log-ingestion-20220808151355927100000001]
module.newrelic_log_ingestion.aws_lambda_function.ingestion_function: Refreshing state... [id=newrelic-log-ingestion]
aws_iam_role_policy.kalkulacka-cloudwatch: Refreshing state... [id=kalkulacka:kalkulacka-cloudwatch]
aws_lambda_function.kalkulacka: Refreshing state... [id=Kalkulacka]
aws_api_gateway_rest_api.kalkulacka: Refreshing state... [id=qxkgzy4u31]
module.newrelic_log_ingestion.aws_lambda_permission.log_invoke_permission: Refreshing state... [id=terraform-20220905093338644600000002]
aws_s3_bucket_server_side_encryption_configuration.data: Refreshing state... [id=cesko-digital-kalkulacka-data]
aws_s3_bucket_policy.data: Refreshing state... [id=cesko-digital-kalkulacka-data]
aws_s3_bucket_acl.data: Refreshing state... [id=cesko-digital-kalkulacka-data,private]
aws_api_gateway_deployment.kalkulacka: Refreshing state... [id=e9zbbk]
aws_lambda_permission.api-gateway-invoke-lambda: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_api_gateway_stage.kalkulacka: Refreshing state... [id=ags-qxkgzy4u31-default]
aws_s3_bucket_server_side_encryption_configuration.frontend: Refreshing state... [id=cesko-digital-kalkulacka-frontend-2]
aws_s3_bucket_policy.frontend: Refreshing state... [id=cesko-digital-kalkulacka-frontend-2]
aws_s3_bucket_acl.frontend: Refreshing state... [id=cesko-digital-kalkulacka-frontend-2,private]
aws_cloudfront_distribution.distribution: Refreshing state... [id=EQ9HHUGA34PWX]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_dynamodb_table.dynamodb_table_results will be created
  + resource "aws_dynamodb_table" "dynamodb_table_results" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "result_id"
      + id               = (known after apply)
      + name             = "Results"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags_all         = (known after apply)
      + write_capacity   = (known after apply)

      + attribute {
          + name = "result_id"
          + type = "S"
        }

      + point_in_time_recovery {
          + enabled = (known after apply)
        }

      + server_side_encryption {
          + enabled     = true
          + kms_key_arn = (known after apply)
        }

      + ttl {
          + attribute_name = "TimeToExist"
          + enabled        = false
        }
    }

  # aws_iam_role_policy.kalkulacka-dynamodb will be created
  + resource "aws_iam_role_policy" "kalkulacka-dynamodb" {
      + id     = (known after apply)
      + name   = "kalkulacka-dynamodb"
      + policy = (known after apply)
      + role   = "kalkulacka"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @martin-majlis, Action: `pull_request`*